In [1]:
import numpy as np
import pandas as pd

<h1>Questão 1</h1>

In [2]:
mercearia = pd.DataFrame({"loja":["A", "A", "A"],
"dia": ["sex", "sab", "dom"],
"valor": [7500, 9500, 8200]})

farmacia = pd.DataFrame({"loja":["B", "B", "B"],
"dia": ["sex", "sab", "dom"],
"valor": [5100, 8250, 9900]})

restaurante = pd.DataFrame({"loja":["C", "C"],
"dia": ["sab", "dom"],
"valor": [7500, 11800]})

In [3]:
pd.concat([mercearia,farmacia, restaurante], ignore_index=True)

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

In [4]:
pd.concat([mercearia,farmacia, restaurante], axis=1)

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

* A diferença entre as duas saídas é que na primeira a saída é feita fazendo a concatenação dos dois DF de forma vertical, um acima do outro; já na segunda a saída ocorre de forma horizontal;
* Os valores NaN ocorrem na junçãos dos DF quando um dos DF tem uma coluna/linha a menos que e para se adequar ao formato, os espaços vazios são preenchidos por valores NaN.

<h1>Questão 2</h1>

In [6]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})
PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

<h2>LETRA A</h2>

In [55]:
pd.merge(PYTHON,SQL, how='outer')

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com
2        rakesh@xyz.com
3    ecg@acmecorpus.com

<h2>LETRA B</h2>

In [56]:
pd.merge(PYTHON,SQL, how='inner')

            email
0  rakesh@xyz.com

Somente o aluno com o e-mail rakesh@xyz.com está matriculado em ambos os cursos.

<h2>LETRA C</h2>

In [59]:
SQL[SQL.email.isin(PYTHON.email)==False]

                email
1  ecg@acmecorpus.com

In [61]:
PYTHON[PYTHON.email.isin(SQL.email)==False]

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

<h1>Questão 3</h1>

In [40]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]}
dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]}

In [41]:
empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

In [42]:
empresa

   id nomDepto local
0  D1  Compras    SP
1  D2       RH    RJ
2  D3       TI    RJ
3  D4   Vendas    SP

In [63]:
funcionarios

    num    nome  salario idDepto
0  3199     Ana     1600      D2
1  3269   David     2975      D3
2  3555    José     1500    None
3  3788  Marina     5000      D2
4  3844    Luís     3000      D4

In [66]:
pd.merge(empresa,funcionarios,left_on="id",right_on="idDepto")

   id nomDepto local   num    nome  salario idDepto
0  D2       RH    RJ  3199     Ana     1600      D2
1  D2       RH    RJ  3788  Marina     5000      D2
2  D3       TI    RJ  3269   David     2975      D3
3  D4   Vendas    SP  3844    Luís     3000      D4